Fase 1: Exploración y Limpieza

Exploración inicial:

- Realiza una exploración de los datos para identificar posibles problemas, como valores nulos, atipicos o datos faltantes en las columnas relevantes

- Utiliza funciones de Pandas para obtener información sobre la estructura de los datos , la presencia de valores nulos y estadísticas básicas de las columnas involucradas

- Une los dos conjuntos de datos de la manera más eficiente


Limpieza de datos:

- Elimina o trata los valores nulos, si los hay, en las columnas clave para asegurar que los datos están completos.

- Verifica la consistencia y correción de los datos para asegurarte de que los datos se presenten de forma coherente.

- Realiza cualquier ajuste o conversión necesaria en las columnas (por ejemplo cambiar tipo de datos) para garantizar la adecuacion de los datos para el analisis estadístico.

In [36]:
# importamos las librerías que necesitamos

# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

# Visualización
# ------------------------------------------------------------------------------
import matplotlib.pyplot as plt
import seaborn as sns

# Evaluar linealidad de las relaciones entre las variables
# y la distribución de las variables
# ------------------------------------------------------------------------------
#import scipy.stats as stats
import scipy.stats as st
import scipy.stats as stats
from scipy.stats import shapiro, poisson, chisquare, expon, kstest

# Librerias para imputar nulos
# ------------------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.impute import KNNImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer

# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Gestión de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

In [37]:
## Cargar las bases de datos:

df_flight_activity = pd.read_csv("Customer_Flight_Activity.csv")
df_flight_activity.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100018,2017,1,3,0,3,1521,152.0,0,0
1,100102,2017,1,10,4,14,2030,203.0,0,0
2,100140,2017,1,6,0,6,1200,120.0,0,0
3,100214,2017,1,0,0,0,0,0.0,0,0
4,100272,2017,1,0,0,0,0,0.0,0,0

In [38]:
df_loyalty_history = pd.read_csv("Customer_Loyalty_History.csv")
df_loyalty_history.head()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [39]:
## Exploración básica de los dataset a través de la funcion:

def exploracion_df(data):
    print('------------------------------------------')
    print(data.head())
    print('------------------------------------------')
    print(data.columns)
    print('------------------------------------------')
    print(data.shape)

In [40]:
# para el dataset 1

data = df_flight_activity

exploracion_df(data)

------------------------------------------
   Loyalty Number  Year  Month  Flights Booked  Flights with Companions  \
0          100018  2017      1               3                        0
1          100102  2017      1              10                        4
2          100140  2017      1               6                        0
3          100214  2017      1               0                        0
4          100272  2017      1               0                        0

   Total Flights  Distance  Points Accumulated  Points Redeemed  \
0              3      1521               152.0                0
1             14      2030               203.0                0
2              6      1200               120.0                0
3              0         0                 0.0                0
4              0         0                 0.0                0

   Dollar Cost Points Redeemed
0                            0
1                            0
2                            0
3                            0
4                            0
------------------------------------------
Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed'],
      dtype='object')
------------------------------------------
(405624, 10)

In [41]:
# para el dataset 2

data = df_loyalty_history

exploracion_df(data)

------------------------------------------
   Loyalty Number Country          Province       City Postal Code  Gender  \
0          480934  Canada           Ontario    Toronto     M2Z 4K1  Female
1          549612  Canada           Alberta   Edmonton     T3G 6Y6    Male
2          429460  Canada  British Columbia  Vancouver     V6E 3D9    Male
3          608370  Canada           Ontario    Toronto     P1W 1K4    Male
4          530508  Canada            Quebec       Hull     J8Y 3Z5    Male

  Education    Salary Marital Status Loyalty Card      CLV Enrollment Type  \
0  Bachelor   83236.0        Married         Star  3839.14        Standard
1   College       NaN       Divorced         Star  3839.61        Standard
2   College       NaN         Single         Star  3839.75        Standard
3   College       NaN         Single         Star  3839.75        Standard
4  Bachelor  103495.0        Married         Star  3842.79        Standard

   Enrollment Year  Enrollment Month  Cancellation Year  Cancellation Month
0             2016                 2                NaN                 NaN
1             2016                 3                NaN                 NaN
2             2014                 7             2018.0                 1.0
3             2013                 2                NaN                 NaN
4             2014                10                NaN                 NaN
------------------------------------------
Index(['Loyalty Number', 'Country', 'Province', 'City', 'Postal Code',
       'Gender', 'Education', 'Salary', 'Marital Status', 'Loyalty Card',
       'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month',
       'Cancellation Year', 'Cancellation Month'],
      dtype='object')
------------------------------------------
(16737, 16)

In [42]:
df_flight_activity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB

In [43]:
df_flight_activity.describe()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
count,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000
mean,550037.873084,2017.500000,6.500000,4.115052,1.031805,5.146858,1208.880059,123.692721,30.696872,2.484503
std,258935.286969,0.500001,3.452057,5.225518,2.076869,6.521227,1433.155320,146.599831,125.486049,10.150038
min,100018.000000,2017.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,326961.000000,2017.000000,3.750000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,550834.000000,2017.500000,6.500000,1.000000,0.000000,1.000000,488.000000,50.000000,0.000000,0.000000
75%,772194.000000,2018.000000,9.250000,8.000000,1.000000,10.000000,2336.000000,239.000000,0.000000,0.000000
max,999986.000000,2018.000000,12.000000,21.000000,11.000000,32.000000,6293.000000,676.500000,876.000000,71.000000

In [44]:
df_loyalty_history.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB

In [45]:
df_loyalty_history.describe()

,Loyalty Number,Salary,CLV,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
count,16737.000000,12499.000000,16737.000000,16737.000000,16737.000000,2067.000000,2067.000000
mean,549735.880445,79245.609409,7988.896536,2015.253211,6.669116,2016.503145,6.962748
std,258912.132453,35008.297285,6860.982280,1.979111,3.398958,1.380743,3.455297
min,100018.000000,-58486.000000,1898.010000,2012.000000,1.000000,2013.000000,1.000000
25%,326603.000000,59246.500000,3980.840000,2014.000000,4.000000,2016.000000,4.000000
50%,550434.000000,73455.000000,5780.180000,2015.000000,7.000000,2017.000000,7.000000
75%,772019.000000,88517.500000,8940.580000,2017.000000,10.000000,2018.000000,10.000000
max,999986.000000,407228.000000,83325.380000,2018.000000,12.000000,2018.000000,12.000000

Informacion relevante sobre los datos:

- el primer df (df_flight_activity) NO tiene nulos y todas las columnas coinciden con el tipo de dato
- el segundo df (df_loyalty_history) SI tiene nulos (salary, cancellation Year y cancellation Month) y las columnas coinciden con el tipo de dato

In [46]:
df_flight_activity.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed'],
      dtype='object')

In [47]:
df_loyalty_history.columns

Index(['Loyalty Number', 'Country', 'Province', 'City', 'Postal Code',
       'Gender', 'Education', 'Salary', 'Marital Status', 'Loyalty Card',
       'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month',
       'Cancellation Year', 'Cancellation Month'],
      dtype='object')

In [48]:
## Unimos todos los datos en un único df para trabajar con el a partir de ahora, elijo hacer merge porque tienen columna en común: "loyalty_number"

df_unido_merge = df_flight_activity.merge(df_loyalty_history, left_on = 'Loyalty Number', right_on = 'Loyalty Number')
df_unido_merge.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,Canada,Ontario,Toronto,M1R 4K3,Male,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,Canada,British Columbia,Dawson Creek,U5I 4F1,Female,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,Canada,British Columbia,Vancouver,V5R 1W3,Male,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,Canada,Ontario,Toronto,P1L 8X8,Female,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN

In [49]:
df_unido_merge.columns

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed',
       'Country', 'Province', 'City', 'Postal Code', 'Gender', 'Education',
       'Salary', 'Marital Status', 'Loyalty Card', 'CLV', 'Enrollment Type',
       'Enrollment Year', 'Enrollment Month', 'Cancellation Year',
       'Cancellation Month'],
      dtype='object')

In [50]:
df_unido_merge.shape

(405624, 25)

In [51]:
df_unido_merge.tail(10)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
405614,999631,2018,12,11,1,12,2244,224.0,0,0,Canada,British Columbia,Vancouver,V5R 1W3,Female,Bachelor,47349.0,Divorced,Star,2572.51,Standard,2014,1,NaN,NaN
405615,999891,2018,10,0,0,0,0,0.0,0,0,Canada,Nova Scotia,Halifax,B3J 9S2,Female,Bachelor,75616.0,Married,Nova,3745.37,Standard,2016,5,2017.0,1.0
405616,999758,2018,12,1,0,1,896,89.0,0,0,Canada,British Columbia,Vancouver,V5R 1W3,Female,College,NaN,Single,Star,18690.34,Standard,2018,8,NaN,NaN
405617,999891,2018,11,0,0,0,0,0.0,0,0,Canada,Nova Scotia,Halifax,B3J 9S2,Female,Bachelor,75616.0,Married,Nova,3745.37,Standard,2016,5,2017.0,1.0
405618,999891,2018,12,0,0,0,0,0.0,0,0,Canada,Nova Scotia,Halifax,B3J 9S2,Female,Bachelor,75616.0,Married,Nova,3745.37,Standard,2016,5,2017.0,1.0
405619,999902,2018,12,0,0,0,0,0.0,0,0,Canada,Ontario,Toronto,M1R 4K3,Male,College,NaN,Married,Aurora,7290.07,Standard,2014,5,NaN,NaN
405620,999911,2018,12,0,0,0,0,0.0,0,0,Canada,Newfoundland,St. John's,A1C 6H9,Male,Doctor,217943.0,Single,Nova,8564.77,Standard,2012,8,NaN,NaN
405621,999940,2018,12,3,0,3,1233,123.0,0,0,Canada,Quebec,Quebec City,G1B 3L5,Female,Bachelor,47670.0,Married,Nova,20266.50,Standard,2017,7,NaN,NaN
405622,999982,2018,12,0,0,0,0,0.0,0,0,Canada,British Columbia,Victoria,V10 6T5,Male,College,NaN,Married,Star,2631.56,Standard,2018,7,NaN,NaN
405623,999986,2018,12,0,0,0,0,0.0,0,0,Canada,Ontario,Ottawa,K1F 2R2,Female,Bachelor,46594.0,Married,Nova,8257.01,2018 Promotion,2018,2,NaN,NaN

In [52]:
df_unido_merge.isnull().sum()

Loyalty Number                      0
Year                                0
Month                               0
Flights Booked                      0
Flights with Companions             0
Total Flights                       0
Distance                            0
Points Accumulated                  0
Points Redeemed                     0
Dollar Cost Points Redeemed         0
Country                             0
Province                            0
City                                0
Postal Code                         0
Gender                              0
Education                           0
Salary                         102672
Marital Status                      0
Loyalty Card                        0
CLV                                 0
Enrollment Type                     0
Enrollment Year                     0
Enrollment Month                    0
Cancellation Year              355560
Cancellation Month             355560
dtype: int64

In [53]:
df_unido_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 25 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
 10  Country                      405624 non-null  object
 11  Province                     405624 non-null  object
 12  City                         405624 non-null  object
 13  Postal Code                  405624 non-null  object
 14  Gender                       405624 non-null  object
 15  Education                    405624 non-null  object
 16  Salary                       302952 non-null  float64
 17  Marital Status               405624 non-null  object
 18  Loyalty Card                 405624 non-null  object
 19  CLV                          405624 non-null  float64
 20  Enrollment Type              405624 non-null  object
 21  Enrollment Year              405624 non-null  int64
 22  Enrollment Month             405624 non-null  int64
 23  Cancellation Year            50064 non-null   float64
 24  Cancellation Month           50064 non-null   float64
dtypes: float64(5), int64(11), object(9)
memory usage: 77.4+ MB

In [54]:
df_unido_merge.describe()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Salary,CLV,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
count,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,405624.000000,302952.000000,405624.000000,405624.000000,405624.000000,50064.000000,50064.000000
mean,550037.873084,2017.500000,6.500000,4.115052,1.031805,5.146858,1208.880059,123.692721,30.696872,2.484503,79268.825953,7991.976226,2015.252529,6.668008,2016.499521,6.966443
std,258935.286969,0.500001,3.452057,5.225518,2.076869,6.521227,1433.155320,146.599831,125.486049,10.150038,34992.133508,6863.663857,1.979427,3.399766,1.384336,3.448300
min,100018.000000,2017.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,-58486.000000,1898.010000,2012.000000,1.000000,2013.000000,1.000000
25%,326961.000000,2017.000000,3.750000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,59262.000000,3985.320000,2014.000000,4.000000,2016.000000,4.000000
50%,550834.000000,2017.500000,6.500000,1.000000,0.000000,1.000000,488.000000,50.000000,0.000000,0.000000,73479.000000,5776.340000,2015.000000,7.000000,2017.000000,7.000000
75%,772194.000000,2018.000000,9.250000,8.000000,1.000000,10.000000,2336.000000,239.000000,0.000000,0.000000,88612.000000,8936.820000,2017.000000,10.000000,2018.000000,10.000000
max,999986.000000,2018.000000,12.000000,21.000000,11.000000,32.000000,6293.000000,676.500000,876.000000,71.000000,407228.000000,83325.380000,2018.000000,12.000000,2018.000000,12.000000

In [55]:
# A simple vista vemos que hay al menos un error en los datos, porque hay un salario negativo (el mínimo)
# Lo revisamos

df_unido_merge["Salary"].min()

-58486.0

In [56]:
df_valores_menor_0 = df_unido_merge[df_unido_merge['Salary'] < 0]
df_valores_menor_0["Salary"].value_counts()

Salary
-10605.0    24
-58486.0    24
-26322.0    24
-12497.0    24
-57297.0    24
-34079.0    24
-46303.0    24
-19332.0    24
-19325.0    24
-49830.0    24
-45962.0    24
-43234.0    24
-17534.0    24
-9081.0     24
-39503.0    24
-47310.0    24
-46683.0    24
-49001.0    24
-31911.0    24
-46470.0    24
Name: count, dtype: int64

In [57]:
df_valores_mayor_0 = df_unido_merge[df_unido_merge['Salary'] > 0]
df_valores_mayor_0["Salary"].value_counts()

Salary
101933.0    552
61809.0     336
62283.0     336
51573.0     336
78573.0     312
           ...
177400.0     24
60335.0      24
156628.0     24
46008.0      24
56345.0      24
Name: count, Length: 5870, dtype: int64

In [58]:
df_valores_menor_0.shape

(480, 25)

In [59]:
df_valores_mayor_0.shape

(302472, 25)

In [60]:
## Posible problema con columna Salary, 480 de todos los datos son negativos. REVISARLO MAS ADELANTE, en función de relevancia columnas y visualización

In [ ]:
## Voy a explorar cada tipo de columna para ver que tipos de datos contienen y tomar decisiones de limpieza o transformacion

In [62]:
## columnas objeto

cols_object=df_unido_merge.select_dtypes(include='object')
cols_object

,Country,Province,City,Postal Code,Gender,Education,Marital Status,Loyalty Card,Enrollment Type
0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,Married,Aurora,Standard
1,Canada,Ontario,Toronto,M1R 4K3,Male,College,Single,Nova,Standard
2,Canada,British Columbia,Dawson Creek,U5I 4F1,Female,College,Divorced,Nova,Standard
3,Canada,British Columbia,Vancouver,V5R 1W3,Male,Bachelor,Married,Star,Standard
4,Canada,Ontario,Toronto,P1L 8X8,Female,Bachelor,Divorced,Star,Standard
...,...,...,...,...,...,...,...,...,...
405619,Canada,Ontario,Toronto,M1R 4K3,Male,College,Married,Aurora,Standard
405620,Canada,Newfoundland,St. John's,A1C 6H9,Male,Doctor,Single,Nova,Standard
405621,Canada,Quebec,Quebec City,G1B 3L5,Female,Bachelor,Married,Nova,Standard
405622,Canada,British Columbia,Victoria,V10 6T5,Male,College,Married,Star,Standard
405623,Canada,Ontario,Ottawa,K1F 2R2,Female,Bachelor,Married,Nova,2018 Promotion

In [28]:
for col in df_unido_merge.select_dtypes(include='object'):
    print('-----------------------------')
    print('Para la columna:', col)
    print('-----------------------------')
    print('Los valores unicos son')
    print(df_unido_merge[col].unique())
    print('-----------------------------')
    print('Hay tantos valores:')
    print(df_unido_merge[col].value_counts())

-----------------------------
Para la columna: Country
-----------------------------
Los valores unicos son
['Canada']
-----------------------------
Hay tantos valores:
Country
Canada    405624
Name: count, dtype: int64
-----------------------------
Para la columna: Province
-----------------------------
Los valores unicos son
['Alberta' 'Ontario' 'British Columbia' 'Saskatchewan' 'Quebec'
 'Newfoundland' 'Manitoba' 'New Brunswick' 'Nova Scotia'
 'Prince Edward Island' 'Yukon']
-----------------------------
Hay tantos valores:
Province
Ontario                 130896
British Columbia        106848
Quebec                   79968
Alberta                  23400
Manitoba                 15984
New Brunswick            15432
Nova Scotia              12576
Saskatchewan              9936
Newfoundland              6312
Yukon                     2688
Prince Edward Island      1584
Name: count, dtype: int64
-----------------------------
Para la columna: City
-----------------------------
Los valores unicos son
['Edmonton' 'Toronto' 'Dawson Creek' 'Vancouver' 'Regina' 'Montreal'
 'Sudbury' 'Quebec City' 'Peace River' "St. John's" 'Tremblant' 'Ottawa'
 'Trenton' 'Winnipeg' 'Thunder Bay' 'West Vancouver' 'Fredericton'
 'London' 'Halifax' 'Moncton' 'Banff' 'Kingston' 'Whistler'
 'Charlottetown' 'Hull' 'Victoria' 'Calgary' 'Kelowna' 'Whitehorse']
-----------------------------
Hay tantos valores:
City
Toronto           81096
Vancouver         62520
Montreal          49920
Winnipeg          15984
Whistler          14040
Halifax           12576
Ottawa            12312
Edmonton          11808
Quebec City       11760
Trenton           11760
Dawson Creek      10776
Fredericton       10344
Regina             9936
Kingston           9720
Tremblant          9600
Victoria           9504
Hull               8688
West Vancouver     7872
St. John's         6312
Thunder Bay        6264
Sudbury            5520
Moncton            5088
Calgary            4584
Banff              4296
London             4224
Peace River        2712
Whitehorse         2688
Kelowna            2136
Charlottetown      1584
Name: count, dtype: int64
-----------------------------
Para la columna: Postal Code
-----------------------------
Los valores unicos son
['T9G 1W3' 'M1R 4K3' 'U5I 4F1' 'V5R 1W3' 'P1L 8X8' 'P1J 8T7' 'S6J 3G0'
 'H2T 9K8' 'V6E 3D9' 'M5V 1G5' 'H2Y 4R4' 'M8Y 4K8' 'V6E 3Z3' 'G1B 3L5'
 'T9O 2W2' 'A1C 6H9' 'H5Y 2S9' 'K1F 2R2' 'K8V 4B2' 'R3R 3T4' 'P1W 1K4'
 'K8T 5M5' 'V6V 8Z3' 'M2M 7K8' 'E3B 2H2' 'M5B 3E4' 'H2Y 2W2' 'P5S 6R4'
 'P2T 6G3' 'B3J 9S2' 'B3C 2M8' 'H4G 3T4' 'R6Y 4T5' 'H2T 2J6' 'M2Z 4K1'
 'S1J 3C5' 'E1A 2A7' 'V1E 4R6' 'T4V 1D4' 'M9K 2P4' 'R2C 0M5' 'T3G 6Y6'
 'M2M 6J7' 'V6T 1Y8' 'C1A 6E8' 'J8Y 3Z5' 'V10 6T5' 'H3T 8L4' 'T3E 2V9'
 'V09 2E9' 'Y2K 6R0' 'K1G 4Z0' 'M2P 4F6' 'M3R 4K8' 'H3J 5I6']
-----------------------------
Hay tantos valores:
Postal Code
V6E 3D9    21984
V5R 1W3    16608
V6T 1Y8    14040
V6E 3Z3    13200
M2M 7K8    12936
P1J 8T7    12168
H2T 9K8    12024
G1B 3L5    11760
K8V 4B2    11760
H2T 2J6    10800
U5I 4F1    10776
V1E 4R6    10728
E3B 2H2    10344
R2C 0M5    10104
M9K 2P4     9720
H5Y 2S9     9600
V10 6T5     9504
K1F 2R2     9408
H2Y 2W2     8880
J8Y 3Z5     8688
M8Y 4K8     8256
H4G 3T4     8208
B3J 9S2     8016
V6V 8Z3     7872
P2T 6G3     7800
H2Y 4R4     7656
M1R 4K3     7536
P1L 8X8     6792
P1W 1K4     6624
T9G 1W3     6456
A1C 6H9     6312
K8T 5M5     6264
M2Z 4K1     6192
P5S 6R4     5976
M5V 1G5     5520
S6J 3G0     5472
T3G 6Y6     5352
E1A 2A7     5088
T3E 2V9     4584
B3C 2M8     4560
S1J 3C5     4464
T4V 1D4     4296
M5B 3E4     4224
M2M 6J7     3696
R6Y 4T5     3480
M2P 4F6     3048
K1G 4Z0     2904
T9O 2W2     2712
Y2K 6R0     2688
R3R 3T4     2400
H3T 8L4     2184
V09 2E9     2136
C1A 6E8     1584
H3J 5I6      168
M3R 4K8       72
Name: count, dtype: int64
-----------------------------
Para la columna: Gender
-----------------------------
Los valores unicos son
['Female' 'Male']
-----------------------------
Hay tantos valores:
Gender
Female    203640
Male      201984
Name: count, dtype: int64
-----------------------------
Para la columna: Education
-----------------------------
Los valores unicos son
['Bachelor' 'College' 'Master' 'High School or Below' 'Doctor']
-----------------------------
Hay tantos valores:
Education
Bachelor                253752
College                 102672
High School or Below     19008
Doctor                   17856
Master                   12336
Name: count, dtype: int64
-----------------------------
Para la columna: Marital Status
-----------------------------
Los valores unicos son
['Married' 'Single' 'Divorced']
-----------------------------
Hay tantos valores:
Marital Status
Married     235800
Single      108648
Divorced     61176
Name: count, dtype: int64
-----------------------------
Para la columna: Loyalty Card
-----------------------------
Los valores unicos son
['Aurora' 'Nova' 'Star']
-----------------------------
Hay tantos valores:
Loyalty Card
Star      184224
Nova      137568
Aurora     83832
Name: count, dtype: int64
-----------------------------
Para la columna: Enrollment Type
-----------------------------
Los valores unicos son
['Standard' '2018 Promotion']
-----------------------------
Hay tantos valores:
Enrollment Type
Standard          382200
2018 Promotion     23424
Name: count, dtype: int64

In [ ]:
## Conclusion columnas tipo object:

In [63]:
## columnas int

cols_int = df_unido_merge.select_dtypes(include='int')
cols_int

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Redeemed,Dollar Cost Points Redeemed,Enrollment Year,Enrollment Month
0,100018,2017,1,3,0,3,1521,0,0,2016,8
1,100102,2017,1,10,4,14,2030,0,0,2013,3
2,100140,2017,1,6,0,6,1200,0,0,2016,7
3,100214,2017,1,0,0,0,0,0,0,2015,8
4,100272,2017,1,0,0,0,0,0,0,2014,1
...,...,...,...,...,...,...,...,...,...,...,...
405619,999902,2018,12,0,0,0,0,0,0,2014,5
405620,999911,2018,12,0,0,0,0,0,0,2012,8
405621,999940,2018,12,3,0,3,1233,0,0,2017,7
405622,999982,2018,12,0,0,0,0,0,0,2018,7
405623,999986,2018,12,0,0,0,0,0,0,2018,2

In [29]:
for col in df_unido_merge.select_dtypes(include='int'):
    print('-----------------------------')
    print('Para la columna:', col)
    print('-----------------------------')
    print('Los valores unicos son')
    print(df_unido_merge[col].unique())
    print('-----------------------------')
    print('Hay tantos valores:')
    print(df_unido_merge[col].value_counts())

-----------------------------
Para la columna: Loyalty Number
-----------------------------
Los valores unicos son
[100018 100102 100140 ... 999731 999788 999891]
-----------------------------
Hay tantos valores:
Loyalty Number
678205    72
989528    48
373638    48
684889    48
684881    48
          ..
428526    24
428536    24
428565    24
428590    24
999891    24
Name: count, Length: 16737, dtype: int64
-----------------------------
Para la columna: Year
-----------------------------
Los valores unicos son
[2017 2018]
-----------------------------
Hay tantos valores:
Year
2017    202812
2018    202812
Name: count, dtype: int64
-----------------------------
Para la columna: Month
-----------------------------
Los valores unicos son
[ 1  9  2  3 11  4  5  7  6  8 10 12]
-----------------------------
Hay tantos valores:
Month
1     33802
9     33802
2     33802
3     33802
11    33802
4     33802
5     33802
7     33802
6     33802
8     33802
10    33802
12    33802
Name: count, dtype: int64
-----------------------------
Para la columna: Flights Booked
-----------------------------
Los valores unicos son
[ 3 10  6  0  8 11  9  4  7  5  2  1 12 13 14 16 15 17 18 19 20 21]
-----------------------------
Hay tantos valores:
Flights Booked
0     197992
3      18228
11     15705
5      15084
7      14561
8      14357
9      14164
6      13847
2      13641
10     13363
4      12821
1      12667
13     10782
12     10382
14      7057
15      6582
16      4354
17      3899
18      2958
19      1496
20      1156
21       528
Name: count, dtype: int64
-----------------------------
Para la columna: Flights with Companions
-----------------------------
Los valores unicos son
[ 0  4  7  1  6  3  5  2 10  8  9 11]
-----------------------------
Hay tantos valores:
Flights with Companions
0     296887
2      19272
3      19015
1      17905
4      13665
5      13424
6       9911
7       7089
8       3965
9       2944
10      1071
11       476
Name: count, dtype: int64
-----------------------------
Para la columna: Total Flights
-----------------------------
Los valores unicos son
[ 3 14  6  0 15 11 12 10  8  9  7  5 16  2  1 17 13 22  4 19 18 21 26 20
 23 25 27 24 28 30 29 31 32]
-----------------------------
Hay tantos valores:
Total Flights
0     197992
6      15273
10     14393
8      14056
4      13656
2      13032
12     12409
11     12300
9      10688
13     10499
14     10310
7       9873
3       9783
5       9309
15      8544
16      7727
17      6198
1       6106
18      5757
19      4002
20      3417
21      2610
22      1981
23      1616
24      1209
25       900
26       722
27       504
28       306
29       214
30       150
31        61
32        27
Name: count, dtype: int64
-----------------------------
Para la columna: Distance
-----------------------------
Los valores unicos son
[1521 2030 1200 ... 1217  617 4135]
-----------------------------
Hay tantos valores:
Distance
0       197992
2520       410
2880       401
1680       389
2160       365
         ...
1333         1
3722         1
3985         1
4779         1
4135         1
Name: count, Length: 4746, dtype: int64
-----------------------------
Para la columna: Points Redeemed
-----------------------------
Los valores unicos son
[  0 341 364 310 445 312 343 366 389 292 447 324 456 409 436 327 322 291
 323 300 290 309 325 386 321 363 340 670 443 517 444 328 344 367 313 333
 293 449 297 455 372 356 405 381 466 419 369 352 482 335 329 305 415 396
 317 348 314 334 350 330 318 298 420 336 471 680 441 353 484 301 374 417
 501 299 398 307 368 306 347 439 395 481 337 382 426 373 399 424 326 392
 438 467 480 448 308 400 376 375 460 339 385 611 431 320 362 404 442 410
 361 319 435 414 464 477 315 485 370 421 349 371 416 496 510 667 465 434
 346 487 408 500 360 378 345 358 479 380 411 491 505 446 425 476 393 418
 332 401 454 303 594 506 355 302 403 379 437 561 483 597 391 562 342 407
 490 468 488 457 365 357 463 388 413 351 462 440 493 507 338 377 428 525
 390 473 359 423 519 453 522 429 450 383 469 402 354 422 458 384 656 461
 427 478 523 719 538 515 394 472 433 387 540 530 498 512 452 311 470 541
 331 570 527 658 494 638 486 509 316 492 536 502 551 504 304 296 294 495
 432 526 459 589 529 586 537 503 552 779 516 639 474 547 542 557 406 563
 511 518 532 553 508 560 676 716 593 513 499 566 497 546 451 533 489 708
 531 567 521 412 430 610 528 556 582 720 397 578 772 571 534 539 576 585
 520 601 598 630 524 588 550 514 573 544 669 577 580 591 614 574 579 595
 618 776 548 602 543 581 572 607 603 564 620 615 636 575 584 559 648 590
 545 627 608 568 625 637 632 650 600 613 621 535 587 475 592 624 619 554
 583 628 558 664 789 635 617 699 604 646 659 616 704 569 626 609 751 599
 644 800 677 666 596 612 629 657 675 702 683 633 811 688 565 706 605 549
 662 660 295 673 555 631 715 651 697 792 678 655 707 668 687 622 642 781
 695 711 701 721 623 693 692 640 665 684 745 808 746 749 694 643 725 850
 703 726 691 740 737 689 765 649 690 661 696 682 700 750 771 798 710 736
 757 743 654 758 647 606 718 739 814 761 783 679 766 777 799 723 653 730
 681 760 793 742 685 734 839 782 735 756 795 728 780 802 815 851 820 770
 705 738 645 686 755 754 778 671 634 762 784 717 797 744 672 768 790 741
 824 748 674 825 794 845 827 801 714 731 724 876 747 663 709 823 791 804
 832 698 727 833 810 864 753 840 722 641 822 834 844 865 869 733 828 773
 713 821 849 767 759 729 803 838 775 818 843 830 847 872 809 786 812 785
 841 752 712 816 289 652 787 852 848 769 846 870 871 796 807 774 805 763
 806 836 837 857 813 873 732 826 858 817 829 819 866 842 861 855 831 875
 868 835 764 862 874 860 863 854 788 867 859]
-----------------------------
Hay tantos valores:
Points Redeemed
0      381443
447       103
523       100
443        98
516        97
        ...
834         1
858         1
862         1
869         1
859         1
Name: count, Length: 587, dtype: int64
-----------------------------
Para la columna: Dollar Cost Points Redeemed
-----------------------------
Los valores unicos son
[ 0 28 30 25 36 32 24 26 37 33 35 27 31 54 42 29 38 34 39 55 41 49 40 48
 45 53 58 44 43 46 52 47 63 57 62 51 50 64 56 61 65 60 68 59 66 69 67 71
 70]
-----------------------------
Hay tantos valores:
Dollar Cost Points Redeemed
0     381443
36      1037
38      1001
40       993
42       983
39       943
44       923
41       913
37       887
43       877
35       852
34       844
32       817
33       800
45       779
30       772
46       753
31       722
47       675
48       638
28       598
29       596
50       595
49       568
52       482
51       435
27       421
54       402
26       379
53       377
56       365
55       343
57       274
58       265
60       260
59       219
25       209
61       175
63       175
62       155
64       152
24       110
66       106
65        90
68        85
67        68
70        38
69        28
71         2
Name: count, dtype: int64
-----------------------------
Para la columna: Enrollment Year
-----------------------------
Los valores unicos son
[2016 2013 2015 2014 2012 2017 2018]
-----------------------------
Hay tantos valores:
Enrollment Year
2018    72816
2017    60432
2016    59520
2013    58032
2014    57288
2015    56520
2012    41016
Name: count, dtype: int64
-----------------------------
Para la columna: Enrollment Month
-----------------------------
Los valores unicos son
[ 8  3  7  1  9  5 10  2  4  6 11 12]
-----------------------------
Hay tantos valores:
Enrollment Month
5     36480
12    35832
7     35712
11    35064
10    35016
8     34560
6     34056
9     33792
4     33696
3     32880
2     29568
1     28968
Name: count, dtype: int64

In [30]:
## conclusion columnas tipo int:

# cambiar month y year de int a object??

In [67]:
## columnas tipo float

cols_float = df_unido_merge.select_dtypes(include='float')
cols_float

,Points Accumulated,Salary,CLV,Cancellation Year,Cancellation Month
0,152.0,92552.0,7919.20,NaN,NaN
1,203.0,NaN,2887.74,NaN,NaN
2,120.0,NaN,2838.07,NaN,NaN
3,0.0,63253.0,4170.57,NaN,NaN
4,0.0,91163.0,6622.05,NaN,NaN
...,...,...,...,...,...
405619,0.0,NaN,7290.07,NaN,NaN
405620,0.0,217943.0,8564.77,NaN,NaN
405621,123.0,47670.0,20266.50,NaN,NaN
405622,0.0,NaN,2631.56,NaN,NaN
405623,0.0,46594.0,8257.01,NaN,NaN

In [31]:
for col in df_unido_merge.select_dtypes(include='float'):
    print('-----------------------------')
    print('Para la columna:', col)
    print('-----------------------------')
    print('Los valores unicos son')
    print(df_unido_merge[col].unique())
    print('-----------------------------')
    print('Hay tantos valores:')
    print(df_unido_merge[col].value_counts())

-----------------------------
Para la columna: Points Accumulated
-----------------------------
Los valores unicos son
[152.   203.   120.   ...  18.75 601.   626.  ]
-----------------------------
Hay tantos valores:
Points Accumulated
0.00      197992
180.00       763
270.00       734
288.00       717
189.00       709
           ...
658.50         1
556.25         1
10.80          1
565.50         1
626.00         1
Name: count, Length: 1549, dtype: int64
-----------------------------
Para la columna: Salary
-----------------------------
Los valores unicos son
[92552.    nan 63253. ... 23160. 97206. 56345.]
-----------------------------
Hay tantos valores:
Salary
101933.0    552
62283.0     336
61809.0     336
51573.0     336
81765.0     312
           ...
46008.0      24
78925.0      24
103563.0     24
50570.0      24
56345.0      24
Name: count, Length: 5890, dtype: int64
-----------------------------
Para la columna: CLV
-----------------------------
Los valores unicos son
[7919.2  2887.74 2838.07 ... 6990.69 3151.16 8409.07]
-----------------------------
Hay tantos valores:
CLV
3873.65     312
4330.39     312
5181.62     312
10208.93    312
25464.82    312
           ...
2801.56      24
3509.97      24
4041.24      24
2754.14      24
8409.07      24
Name: count, Length: 7984, dtype: int64
-----------------------------
Para la columna: Cancellation Year
-----------------------------
Los valores unicos son
[  nan 2018. 2015. 2016. 2014. 2013. 2017.]
-----------------------------
Hay tantos valores:
Cancellation Year
2018.0    15648
2017.0    12192
2016.0    10272
2015.0     6480
2014.0     4416
2013.0     1056
Name: count, dtype: int64
-----------------------------
Para la columna: Cancellation Month
-----------------------------
Los valores unicos son
[nan  3.  9.  2.  7.  6.  8.  4.  1.  5. 11. 12. 10.]
-----------------------------
Hay tantos valores:
Cancellation Month
11.0    5160
8.0     5112
12.0    5112
7.0     4560
10.0    4368
9.0     4224
6.0     3984
1.0     3744
3.0     3600
5.0     3576
2.0     3336
4.0     3288
Name: count, dtype: int64

In [ ]:
## Conclusion columnas tipo float:

In [32]:
## ELIMINAMOS NULOS DE LAS 3 COLUMNAS

In [33]:
## VER DUPLICADOS (UNA VEZ ELIMINADOS NULOS)

df_unido_merge.duplicated()

0         False
1         False
2         False
3         False
4         False
          ...
405619    False
405620    False
405621    False
405622    False
405623    False
Length: 405624, dtype: bool

In [34]:
df_unido_merge.duplicated().sum()

1864